## Introduction to Data Science

### Introduction to Pandas

In [1]:
#import pylab
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import os
import pathlib


%matplotlib inline
#%matplotlib notebook

### Pandas Data Structures: Series

In [75]:
obj = pd.Series([4, 7, -5, 3, 5])
obj

0    4
1    7
2   -5
3    3
4    5
dtype: int64

In [76]:
obj.values

array([ 4,  7, -5,  3,  5])

In [77]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [78]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob       4
Steve     7
Jeff     -5
Ryan      3
Fernie    5
dtype: int64

In [79]:
obj['Bob']

4

In [80]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [81]:
obj2['c']

3

In [82]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [83]:
obj2[obj2 < 0]

a   -5
dtype: int64

In [84]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [85]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [86]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [87]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [88]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [89]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [90]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [91]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### Pandas Data Structures: Dataframe

In [92]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [93]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [94]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [95]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [96]:
frame2['nova'] = 13
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    13
two    2001    Ohio  1.7  NaN    13
three  2002    Ohio  3.6  NaN    13
four   2001  Nevada  2.4  NaN    13
five   2002  Nevada  2.9  NaN    13

In [97]:
frame2.nova = 23
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    23
two    2001    Ohio  1.7  NaN    23
three  2002    Ohio  3.6  NaN    23
four   2001  Nevada  2.4  NaN    23
five   2002  Nevada  2.9  NaN    23

In [98]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [99]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [100]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [101]:
#frame2.loc['three']
frame2.loc['three','state']

'Ohio'

In [102]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5  16.5    23
two    2001    Ohio  1.7  16.5    23
three  2002    Ohio  3.6  16.5    23
four   2001  Nevada  2.4  16.5    23
five   2002  Nevada  2.9  16.5    23

In [103]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   0.0    23
two    2001    Ohio  1.7   1.0    23
three  2002    Ohio  3.6   2.0    23
four   2001  Nevada  2.4   3.0    23
five   2002  Nevada  2.9   4.0    23

In [104]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   NaN    23
two    2001    Ohio  1.7  -1.2    23
three  2002    Ohio  3.6   NaN    23
four   2001  Nevada  2.4  -1.5    23
five   2002  Nevada  2.9  -1.7    23

In [105]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  nova  eastern
one    2000    Ohio  1.5   NaN    23     True
two    2001    Ohio  1.7  -1.2    23     True
three  2002    Ohio  3.6   NaN    23     True
four   2001  Nevada  2.4  -1.5    23    False
five   2002  Nevada  2.9  -1.7    23    False

In [106]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [107]:
transpose = frame2.pivot(index= 'year', columns='state', values='pop') 
transpose

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [108]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [109]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [110]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [111]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [112]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [113]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [114]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [115]:
frame5 = pd.concat([frame4, frame4])
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [116]:
frame5.drop_duplicates(['Nevada'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [117]:
dates = pd.date_range("20160101", periods=10)
data = np.random.random((10,3))
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.940043  0.256364  0.563105
2016-01-02  0.695304  0.079596  0.796599
2016-01-03  0.945946  0.422931  0.256923
2016-01-04  0.574211  0.017305  0.416228
2016-01-05  0.289000  0.564472  0.143662
2016-01-06  0.367389  0.224179  0.552220
2016-01-07  0.251609  0.711848  0.869820
2016-01-08  0.743957  0.977056  0.848882
2016-01-09  0.192830  0.291787  0.464743
2016-01-10  0.027533  0.685581  0.192697

In [118]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.695304  0.079596  0.796599
2016-01-03  0.945946  0.422931  0.256923

In [119]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.574211  0.017305  0.416228
2016-01-05  0.289000  0.564472  0.143662
2016-01-06  0.367389  0.224179  0.552220
2016-01-07  0.251609  0.711848  0.869820

In [120]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.940043  0.563105
2016-01-02  0.695304  0.796599

In [121]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.574211  0.017305
2016-01-05  0.289000  0.564472

In [122]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.502782   0.423112   0.510488
std     0.322659   0.306667   0.266838
min     0.027533   0.017305   0.143662
25%     0.260957   0.232225   0.296749
50%     0.470800   0.357359   0.508481
75%     0.731794   0.655304   0.738225
max     0.945946   0.977056   0.869820

In [123]:
df.sort_index(axis=0, ascending=False,) # inplace=True)

             Column1   Column2   Column3
2016-01-10  0.027533  0.685581  0.192697
2016-01-09  0.192830  0.291787  0.464743
2016-01-08  0.743957  0.977056  0.848882
2016-01-07  0.251609  0.711848  0.869820
2016-01-06  0.367389  0.224179  0.552220
2016-01-05  0.289000  0.564472  0.143662
2016-01-04  0.574211  0.017305  0.416228
2016-01-03  0.945946  0.422931  0.256923
2016-01-02  0.695304  0.079596  0.796599
2016-01-01  0.940043  0.256364  0.563105

In [124]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-04  0.574211  0.017305  0.416228
2016-01-02  0.695304  0.079596  0.796599
2016-01-06  0.367389  0.224179  0.552220
2016-01-01  0.940043  0.256364  0.563105
2016-01-09  0.192830  0.291787  0.464743
2016-01-03  0.945946  0.422931  0.256923
2016-01-05  0.289000  0.564472  0.143662
2016-01-10  0.027533  0.685581  0.192697
2016-01-07  0.251609  0.711848  0.869820
2016-01-08  0.743957  0.977056  0.848882

In [125]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [126]:
df1.head()

             ColumnA   ColumnB
2016-01-01  0.593531  0.835141
2016-01-02  0.654512  0.640371
2016-01-03  0.517968  0.374721
2016-01-04  0.425010  0.063748
2016-01-05  0.435053  0.692680

In [127]:
df2.head()

             ColumnC   ColumnD
2016-01-01  0.129855  0.382356
2016-01-02  0.940402  0.523013
2016-01-03  0.975311  0.064995
2016-01-04  0.908495  0.742127
2016-01-05  0.126930  0.347005

In [128]:
df1.join(df2)

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.593531  0.835141  0.129855  0.382356
2016-01-02  0.654512  0.640371  0.940402  0.523013
2016-01-03  0.517968  0.374721  0.975311  0.064995
2016-01-04  0.425010  0.063748  0.908495  0.742127
2016-01-05  0.435053  0.692680  0.126930  0.347005
2016-01-06  0.911584  0.662900  0.634845  0.743294

In [129]:
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss'], index=dates)

In [130]:
df3.head()

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss
2016-01-01  0.593531  0.835141  0.129855  0.382356     Profit
2016-01-02  0.654512  0.640371  0.940402  0.523013       Loss
2016-01-03  0.517968  0.374721  0.975311  0.064995     Profit
2016-01-04  0.425010  0.063748  0.908495  0.742127     Profit
2016-01-05  0.435053  0.692680  0.126930  0.347005     Profit

In [131]:
df3.groupby('ProfitLoss').mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.783048  0.651636  0.787623  0.633153
Profit      0.492890  0.491572  0.535148  0.384121

idmin & idmax

In [136]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-06 00:00:00', freq='D')

In [137]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-04 00:00:00', freq='D')

ne()

In [138]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]
df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [141]:
df['x'].ne(0).idxmax()

6

In [142]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [143]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5